# Dotfiles Brewfile
# Run: brew bundle --file=Brewfile
# Add new items and re-run to install

# =============================================================================
# CLI TOOLS
# =============================================================================
brew "node"               # JavaScript runtime
brew "pnpm"               # Fast, disk space efficient package manager
brew "just"               # Command runner (like make but better)
brew "shellcheck"         # Shell script linter
brew "prettier"           # Code formatter
brew "tmux"               # Terminal multiplexer
brew "zoxide"             # Smarter cd command
brew "fzf"                # Fuzzy finder
brew "sesh"               # Tmux session manager
brew "gum"                # TUI toolkit for shell scripts

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================
brew "git"                # Version control
brew "gh"                 # GitHub CLI
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "ripgrep"            # Fast grep alternative
brew "fd"                 # Fast find alternative
brew "bat"                # Cat with syntax highlighting
brew "eza"                # Modern ls replacement
brew "difftastic"         # Structural diff tool

# =============================================================================
# APPLICATIONS (CASKS)
# =============================================================================
cask "visual-studio-code" # Code editor
# cask "docker"           # Container platform (uncomment if needed)
